In [1]:
import pandas as pd

In [2]:
path = '/content/data.csv'  # path of the dataset 

df = pd.read_csv(path)  # reads data and stores as dataframe

In [3]:
df

     passenger_id  pclass  ...                 home.dest survived
0            1216       3  ...                       NaN        1
1             699       3  ...                   Croatia        0
2            1267       3  ...                       NaN        0
3             449       2  ...      Cornwall / Akron, OH        1
4             576       2  ...  Barre, Co Washington, VT        0
..            ...     ...  ...                       ...      ...
845           158       1  ...       London / Birmingham        0
846           174       1  ...               Buffalo, NY        0
847           467       2  ...        Moscow / Bronx, NY        1
848          1112       3  ...                       NaN        0
849           425       2  ...                 Bronx, NY        0

[850 rows x 15 columns]

In [ ]:
df.drop(['name','passenger_id','home.dest'], axis='columns', inplace=True)

In [11]:
df.drop(['cabin'], axis='columns', inplace=True)

In [19]:
df

     pclass     sex   age  ...     fare  embarked survived
0         3  female   NaN  ...   7.7333         Q        1
1         3    male  38.0  ...   8.6625         S        0
2         3  female  30.0  ...  24.1500         S        0
3         2  female  54.0  ...  23.0000         S        1
4         2    male  40.0  ...  13.0000         S        0
..      ...     ...   ...  ...      ...       ...      ...
845       1    male  55.0  ...  50.0000         S        0
846       1    male  58.0  ...  29.7000         C        0
847       2  female  24.0  ...  26.0000         S        1
848       3  female   3.0  ...  13.7750         S        0
849       2    male  52.0  ...  13.0000         S        0

[850 rows x 9 columns]

In [12]:
df['embarked'].value_counts()

S    589
C    176
Q     84
Name: embarked, dtype: int64

In [14]:
 df['body'].isna().sum()

777

In [15]:
df.drop(['body'], axis='columns', inplace=True)

In [17]:
 df['boat'].isna().sum()

542

In [18]:
df.drop(['boat'], axis='columns', inplace=True)

In [20]:
 df['pclass'].isna().sum()

0

In [21]:
 df['age'].isna().sum()

174

In [22]:
df['age'].fillna(df['age'].median(), inplace=True)

In [28]:
 df.isna().sum()

pclass      0
sex         0
age         0
sibsp       0
parch       0
ticket      0
fare        0
embarked    1
survived    0
dtype: int64

In [24]:
 df['ticket'].isna().sum()

0

In [26]:
df['fare'].isna().sum()

1

In [27]:
df['fare'].fillna(df['fare'].median(), inplace=True)

In [77]:
col_norm = ['age']

df[col_norm]/df[col_norm].max()

        age
0    0.3500
1    0.4750
2    0.3750
3    0.6750
4    0.5000
..      ...
845  0.6875
846  0.7250
847  0.3000
848  0.0375
849  0.6500

[849 rows x 1 columns]

In [78]:
df

     pclass  sex   age  sibsp  ...              ticket     fare  embarked  survived
0         3    0  28.0      0  ...              335432   7.7333         1         1
1         3    1  38.0      0  ...              315089   8.6625         2         0
2         3    0  30.0      1  ...              345773  24.1500         2         0
3         2    0  54.0      1  ...               29105  23.0000         2         1
4         2    1  40.0      0  ...               28221  13.0000         2         0
..      ...  ...   ...    ...  ...                 ...      ...       ...       ...
845       1    1  55.0      0  ...                 680  50.0000         2         0
846       1    1  58.0      0  ...               11771  29.7000         0         0
847       2    0  24.0      1  ...              244367  26.0000         2         1
848       3    0   3.0      1  ...  SOTON/O.Q. 3101315  13.7750         2         0
849       2    1  52.0      0  ...              250647  13.0000         2         0

[849 rows x 9 columns]

In [31]:
from sklearn import preprocessing

In [32]:
label_encoder = preprocessing.LabelEncoder()
df['sex']= label_encoder.fit_transform(df['sex'])

In [33]:
df

     pclass  sex   age  sibsp  ...              ticket     fare  embarked survived
0         3    0  28.0      0  ...              335432   7.7333         Q        1
1         3    1  38.0      0  ...              315089   8.6625         S        0
2         3    0  30.0      1  ...              345773  24.1500         S        0
3         2    0  54.0      1  ...               29105  23.0000         S        1
4         2    1  40.0      0  ...               28221  13.0000         S        0
..      ...  ...   ...    ...  ...                 ...      ...       ...      ...
845       1    1  55.0      0  ...                 680  50.0000         S        0
846       1    1  58.0      0  ...               11771  29.7000         C        0
847       2    0  24.0      1  ...              244367  26.0000         S        1
848       3    0   3.0      1  ...  SOTON/O.Q. 3101315  13.7750         S        0
849       2    1  52.0      0  ...              250647  13.0000         S        0

[850 rows x 9 columns]

In [43]:
df['embarked'].unique()

array(['Q', 'S', 'C', nan], dtype=object)

In [41]:
df.dropna()

     pclass  sex   age  sibsp  ...              ticket     fare  embarked survived
0         3    0  28.0      0  ...              335432   7.7333         Q        1
1         3    1  38.0      0  ...              315089   8.6625         S        0
2         3    0  30.0      1  ...              345773  24.1500         S        0
3         2    0  54.0      1  ...               29105  23.0000         S        1
4         2    1  40.0      0  ...               28221  13.0000         S        0
..      ...  ...   ...    ...  ...                 ...      ...       ...      ...
845       1    1  55.0      0  ...                 680  50.0000         S        0
846       1    1  58.0      0  ...               11771  29.7000         C        0
847       2    0  24.0      1  ...              244367  26.0000         S        1
848       3    0   3.0      1  ...  SOTON/O.Q. 3101315  13.7750         S        0
849       2    1  52.0      0  ...              250647  13.0000         S        0

[849 rows x 9 columns]

In [44]:
df['embarked'].unique()

array(['Q', 'S', 'C', nan], dtype=object)

In [45]:
df['embarked'].value_counts()

S    589
C    176
Q     84
Name: embarked, dtype: int64

In [46]:
df.isna().sum()

pclass      0
sex         0
age         0
sibsp       0
parch       0
ticket      0
fare        0
embarked    1
survived    0
dtype: int64

In [74]:
df.dropna(inplace=True)

In [51]:
df['embarked'].isnull().sum()

1

In [60]:
df['embarked'].dropna(inplace=True)

In [66]:
label_encoder2 = preprocessing.LabelEncoder()

In [75]:
df['embarked']= label_encoder2.fit_transform(df['embarked'])

In [76]:
df

     pclass  sex   age  sibsp  ...              ticket     fare  embarked  survived
0         3    0  28.0      0  ...              335432   7.7333         1         1
1         3    1  38.0      0  ...              315089   8.6625         2         0
2         3    0  30.0      1  ...              345773  24.1500         2         0
3         2    0  54.0      1  ...               29105  23.0000         2         1
4         2    1  40.0      0  ...               28221  13.0000         2         0
..      ...  ...   ...    ...  ...                 ...      ...       ...       ...
845       1    1  55.0      0  ...                 680  50.0000         2         0
846       1    1  58.0      0  ...               11771  29.7000         0         0
847       2    0  24.0      1  ...              244367  26.0000         2         1
848       3    0   3.0      1  ...  SOTON/O.Q. 3101315  13.7750         2         0
849       2    1  52.0      0  ...              250647  13.0000         2         0

[849 rows x 9 columns]

In [81]:
col_norm = ['age' , 'fare']

# we will use the most basic normalization i.e divide by max 


max_ = [] 


# loop for getting the max of each column 
for i in col_norm : 
  max_.append(df[i].max())

k = 0 

# loop for dividing the column values with the max value 
for i in col_norm : 
  df[i] = df[i]/max_[k]
  k = k + 1

In [82]:
df.drop(['ticket'], axis='columns', inplace=True)

In [83]:
df

     pclass  sex     age  sibsp  parch      fare  embarked  survived
0         3    0  0.3500      0      0  0.015094         1         1
1         3    1  0.4750      0      0  0.016908         2         0
2         3    0  0.3750      1      1  0.047138         2         0
3         2    0  0.6750      1      3  0.044893         2         1
4         2    1  0.5000      0      0  0.025374         2         0
..      ...  ...     ...    ...    ...       ...       ...       ...
845       1    1  0.6875      0      0  0.097594         2         0
846       1    1  0.7250      0      0  0.057971         0         0
847       2    0  0.3000      1      0  0.050749         2         1
848       3    0  0.0375      1      1  0.026887         2         0
849       2    1  0.6500      0      0  0.025374         2         0

[849 rows x 8 columns]

In [92]:
df.corr()

            pclass       sex       age  ...      fare  embarked  survived
pclass    1.000000  0.149794 -0.375877  ... -0.560446  0.203984 -0.327740
sex       0.149794  1.000000  0.029614  ... -0.182268  0.072551 -0.509247
age      -0.375877  0.029614  1.000000  ...  0.192939 -0.070534 -0.034727
sibsp     0.073664 -0.124626 -0.188058  ...  0.142527  0.090982 -0.044305
parch    -0.007207 -0.170968 -0.127504  ...  0.247130  0.060636  0.059910
fare     -0.560446 -0.182268  0.192939  ...  1.000000 -0.255227  0.250514
embarked  0.203984  0.072551 -0.070534  ... -0.255227  1.000000 -0.152179
survived -0.327740 -0.509247 -0.034727  ...  0.250514 -0.152179  1.000000

[8 rows x 8 columns]

In [98]:
X = df.iloc[:, :-1].values
y = df.iloc[:, -1].values

In [87]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.25, random_state = 0)

In [88]:
X_train

array([[2.        , 0.        , 0.4375    , ..., 0.        , 0.04098927,
        2.        ],
       [1.        , 0.        , 0.375     , ..., 0.        , 0.32179837,
        2.        ],
       [3.        , 1.        , 0.375     , ..., 0.        , 0.01541158,
        2.        ],
       ...,
       [3.        , 1.        , 0.35      , ..., 0.        , 0.01415106,
        2.        ],
       [3.        , 1.        , 0.2625    , ..., 0.        , 0.01517579,
        2.        ],
       [1.        , 1.        , 0.5375    , ..., 0.        , 0.0541074 ,
        0.        ]])

In [89]:
from sklearn.tree import DecisionTreeClassifier
classifier = DecisionTreeClassifier(criterion = 'entropy', random_state = 0)
classifier.fit(X_train, y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='entropy',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=0, splitter='best')

In [91]:
from sklearn.metrics import confusion_matrix, accuracy_score
y_pred = classifier.predict(X_test)
cm = confusion_matrix(y_test, y_pred)
print(cm)
accuracy_score(y_test, y_pred)

[[113  19]
 [ 31  50]]

0.7652582159624414